altomaltes/libOTG-stm32f4/src/libs/otg/host/Class/AUDIO/usbh_audio.c
/**
  ******************************************************************************
  * @file    usbh_audio.c
  * @author  MCD Application Team
  * @brief   This file is the AC Layer Handlers for USB Host AC class.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  * @verbatim
  *
  *          ===================================================================
  *                                AUDIO Class  Description
  *          ===================================================================
  *           This driver manages the Audio Class 1.0 following the "USB Device
  *           Class Definition for Audio Devices V1.0 Mar 18, 98".
  *
  *  @endverbatim
  *
  ******************************************************************************
  */

/* BSPDependencies
- "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
- "stm32xxxxx_{eval}{discovery}_io.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_sd.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
- "stm32xxxxx_{eval}{discovery}_sdram.c"
EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_audio.h"


static USBH_StatusTypeDef USBH_AUDIO_InterfaceInit( USBH_HandleTypeDef *phost )
{ USBH_StatusTypeDef out_status, in_status;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  byte  interface, index;
  word ep_size_out = 0U;
  word ep_size_in = 0U;

  interface = USBH_FindInterface(phost, AC_CLASS, USB_SUBCLASS_AUDIOCONTROL, 0x00U);

  if (interface == 0xFFU) /* Not Valid Interface */
  { USBH_DbgLog("Cannot Find the interface for %s class.", phost->pActiveClass->Name);
    return USBH_FAIL;
  }

  phost->pActiveClass->pData = (AUDIO_HandleTypeDef *)USBH_malloc(sizeof(AUDIO_HandleTypeDef));
  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

  if (AUDIO_Handle == NULL)
  { USBH_DbgLog("Cannot allocate memory for AUDIO Handle");
    return USBH_FAIL;
  }

  /* Initialize audio handler */
  (void)USBH_memset(AUDIO_Handle, 0, sizeof(AUDIO_HandleTypeDef));

  /* 1st Step:  Find Audio Interfaces */
  out_status = USBH_AUDIO_FindAudioStreamingIN(phost);

  in_status = USBH_AUDIO_FindAudioStreamingOUT(phost);

  if ((out_status == USBH_FAIL) && (in_status == USBH_FAIL))
  { USBH_DbgLog("%s class configuration not supported.", phost->pActiveClass->Name);
    return USBH_FAIL;
  }

  /* 2nd Step:  Select Audio Streaming Interfaces with largest endpoint size : default behavior */
  for (index = 0U; index < AUDIO_MAX_AUDIO_STD_INTERFACE; index ++)
  { if (AUDIO_Handle->stream_out[index].valid == 1U)
    { if (ep_size_out < AUDIO_Handle->stream_out[index].EpSize)
      { ep_size_out = AUDIO_Handle->stream_out[index].EpSize;
        AUDIO_Handle->headphone.interface = AUDIO_Handle->stream_out[index].interface;
        AUDIO_Handle->headphone.AltSettings = AUDIO_Handle->stream_out[index].AltSettings;
        AUDIO_Handle->headphone.Ep = AUDIO_Handle->stream_out[index].Ep;
        AUDIO_Handle->headphone.EpSize = AUDIO_Handle->stream_out[index].EpSize;
        AUDIO_Handle->headphone.Poll = (byte)AUDIO_Handle->stream_out[index].Poll;
        AUDIO_Handle->headphone.supported = 1U;
      }
    }

    if (AUDIO_Handle->stream_in[index].valid == 1U)
    { if (ep_size_in < AUDIO_Handle->stream_in[index].EpSize)
      { ep_size_in = AUDIO_Handle->stream_in[index].EpSize;
        AUDIO_Handle->microphone.interface = AUDIO_Handle->stream_in[index].interface;
        AUDIO_Handle->microphone.AltSettings = AUDIO_Handle->stream_in[index].AltSettings;
        AUDIO_Handle->microphone.Ep = AUDIO_Handle->stream_in[index].Ep;
        AUDIO_Handle->microphone.EpSize = AUDIO_Handle->stream_in[index].EpSize;
        AUDIO_Handle->microphone.Poll = (byte)AUDIO_Handle->stream_out[index].Poll;
        AUDIO_Handle->microphone.supported = 1U;
      }
    }
  }

  if (USBH_AUDIO_FindHIDControl(phost) == USBH_OK)
  { AUDIO_Handle->control.supported = 1U;
  }

/* 3rd Step:  Find and Parse Audio interfaces
 */
  USBH_AUDIO_ParseCSDescriptors(phost);


/* 4th Step:  Open the Audio streaming pipes
 */
  if ( AUDIO_Handle->headphone.supported == 1U )
  { USBH_AUDIO_BuildHeadphonePath(phost);

    AUDIO_Handle->headphone.Pipe = USBH_AllocPipe(phost, AUDIO_Handle->headphone.Ep);

    /* Open pipe for IN endpoint */

    (void)USBH_OpenPipe(phost,
                        AUDIO_Handle->headphone.Pipe,
                        AUDIO_Handle->headphone.Ep,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_ISOC,
                        AUDIO_Handle->headphone.EpSize);

    (void)USBH_LL_SetToggle(phost,  AUDIO_Handle->headphone.Pipe, 0U);
  }

  if ( AUDIO_Handle->microphone.supported == 1U )
  { (void)USBH_AUDIO_BuildMicrophonePath(phost);
    AUDIO_Handle->microphone.Pipe = USBH_AllocPipe(phost, AUDIO_Handle->microphone.Ep);

    /* Open pipe for IN endpoint */
    (void)USBH_OpenPipe(phost,
                        AUDIO_Handle->microphone.Pipe,
                        AUDIO_Handle->microphone.Ep,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_ISOC,
                        AUDIO_Handle->microphone.EpSize);

    (void)USBH_LL_SetToggle(phost,  AUDIO_Handle->microphone.Pipe, 0U);
  }

  if ( AUDIO_Handle->control.supported == 1U )
  { AUDIO_Handle->control.Pipe  = USBH_AllocPipe(phost, AUDIO_Handle->control.Ep);

    /* Open pipe for IN endpoint */
    (void)USBH_OpenPipe(phost,
                        AUDIO_Handle->control.Pipe,
                        AUDIO_Handle->control.Ep,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_INTR,
                        AUDIO_Handle->control.EpSize);

