altomaltes/libOTG-stm32f4/src/libs/otg/host/Class/AUDIO/usbh_audio.c
    (void)USBH_LL_SetToggle(phost,  AUDIO_Handle->control.Pipe, 0U);

  }

  AUDIO_Handle->req_state = AUDIO_REQ_INIT;
  AUDIO_Handle->control_state = AUDIO_CONTROL_INIT;

  return USBH_OK;
}


/**
  * @brief  USBH_AUDIO_InterfaceDeInit
  *         The function DeInit the Pipes used for the Audio class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_InterfaceDeInit(USBH_HandleTypeDef *phost)
{ AUDIO_HandleTypeDef *AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

  if (AUDIO_Handle->microphone.Pipe != 0x00U)
  { USBH_ClosePipe(phost, AUDIO_Handle->microphone.Pipe);
    USBH_FreePipe(phost, AUDIO_Handle->microphone.Pipe);
    AUDIO_Handle->microphone.Pipe = 0U;     /* Reset the pipe as Free */
  }

  if (AUDIO_Handle->headphone.Pipe != 0x00U)
  { USBH_ClosePipe(phost,  AUDIO_Handle->headphone.Pipe);
    USBH_FreePipe(phost,  AUDIO_Handle->headphone.Pipe);
    AUDIO_Handle->headphone.Pipe = 0U;     /* Reset the pipe as Free */
  }

  if (AUDIO_Handle->control.Pipe != 0x00U)
  { USBH_ClosePipe(phost,  AUDIO_Handle->control.Pipe);
    USBH_FreePipe(phost,  AUDIO_Handle->control.Pipe);
    AUDIO_Handle->control.Pipe = 0U;     /* Reset the pipe as Free */
  }

  if ((phost->pActiveClass->pData) != 0U)
  { USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = 0U;
  }
  return USBH_OK;
}


/**
  * @brief  USBH_AUDIO_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for Audio class.
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_ClassRequest()
{ AUDIO_HandleTypeDef *AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;
  USBH_StatusTypeDef status = USBH_BUSY;
  USBH_StatusTypeDef req_status = USBH_BUSY;


  switch (AUDIO_Handle->req_state)   /* Switch AUDIO REQ state machine */
  { case AUDIO_REQ_INIT:
    case AUDIO_REQ_SET_DEFAULT_IN_INTERFACE:
      if (AUDIO_Handle->microphone.supported == 1U)
      { req_status = USBH_SetInterface(phost,
                                       AUDIO_Handle->microphone.interface,
                                       0U);

        if (req_status == USBH_OK)
        { AUDIO_Handle->req_state = AUDIO_REQ_SET_DEFAULT_OUT_INTERFACE;
        }
        else if (req_status == USBH_NOT_SUPPORTED)
        { USBH_ErrLog("Control error: AUDIO: Device Set interface request failed");
          status = USBH_FAIL;
        }
        else
        { /* .. */
      } }

      else
      { AUDIO_Handle->req_state = AUDIO_REQ_SET_DEFAULT_OUT_INTERFACE;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;

    case AUDIO_REQ_SET_DEFAULT_OUT_INTERFACE:
      if (AUDIO_Handle->headphone.supported == 1U)
      { req_status = USBH_SetInterface(phost,
                                       AUDIO_Handle->headphone.interface,
                                       0U);

        if (req_status == USBH_OK)
        { AUDIO_Handle->req_state = AUDIO_REQ_CS_REQUESTS;
          AUDIO_Handle->cs_req_state = AUDIO_REQ_GET_VOLUME;

          AUDIO_Handle->temp_feature  = AUDIO_Handle->headphone.asociated_feature;
          AUDIO_Handle->temp_channels = AUDIO_Handle->headphone.asociated_channels;
        }
        else
          if (req_status == USBH_NOT_SUPPORTED)
          { USBH_ErrLog("Control error: AUDIO: Device Set interface request failed");
            status = USBH_FAIL;
          }
          else
          { /* .. */
          }
      }
      else
      { AUDIO_Handle->req_state = AUDIO_REQ_CS_REQUESTS;
        AUDIO_Handle->cs_req_state = AUDIO_REQ_GET_VOLUME;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;

    case AUDIO_REQ_CS_REQUESTS:
      if (USBH_AUDIO_HandleCSRequest(phost) == USBH_OK)
      { AUDIO_Handle->req_state = AUDIO_REQ_SET_IN_INTERFACE;
      }
      break;

    case AUDIO_REQ_SET_IN_INTERFACE:
      if (AUDIO_Handle->microphone.supported == 1U)
      { req_status = USBH_SetInterface(phost,
                                       AUDIO_Handle->microphone.interface,
                                       AUDIO_Handle->microphone.AltSettings);

        if (req_status == USBH_OK)
        { AUDIO_Handle->req_state = AUDIO_REQ_SET_OUT_INTERFACE;
        }
        else
          if (req_status == USBH_NOT_SUPPORTED)
          { USBH_ErrLog("Control error: AUDIO: Device Set interface request failed");
            status = USBH_FAIL;
          }
          else
          { /* .. */
          }
      }
      else
      { AUDIO_Handle->req_state = AUDIO_REQ_SET_OUT_INTERFACE;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;
    case AUDIO_REQ_SET_OUT_INTERFACE:
      if (AUDIO_Handle->headphone.supported == 1U)
      { req_status = USBH_SetInterface(phost,
                                       AUDIO_Handle->headphone.interface,
                                       AUDIO_Handle->headphone.AltSettings);

        if (req_status == USBH_OK)
        { AUDIO_Handle->req_state = AUDIO_REQ_IDLE;
        }
        else
          if (req_status == USBH_NOT_SUPPORTED)
          { USBH_ErrLog("Control error: AUDIO: Device Set interface request failed");
            status = USBH_FAIL;
          }
          else
          { /* .. */
          }
      }
      else
      { AUDIO_Handle->req_state = AUDIO_REQ_IDLE;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;
    case AUDIO_REQ_IDLE:
      AUDIO_Handle->play_state = AUDIO_PLAYBACK_INIT;
      phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
      status  = USBH_OK;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    default:
      break;
  }
  return status;
}

/**
  * @brief  USBH_AUDIO_CSRequest
  *         The function is responsible for handling AC Specific requests for a specific feature and channel
  *         for Audio class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_CSRequest( byte feature, byte channel )
{ AUDIO_HandleTypeDef *AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;
  USBH_StatusTypeDef status = USBH_BUSY;
  USBH_StatusTypeDef req_status = USBH_BUSY;
  word VolumeCtl, ResolutionCtl;

  /* Switch AUDIO REQ state machine */
  switch (AUDIO_Handle->cs_req_state)
  { case AUDIO_REQ_GET_VOLUME:
      req_status = USBH_AC_GetCur(phost,
                                  UAC_FEATURE_UNIT,     /* subtype  */
                                  feature,              /* feature  */
                                  VOLUME_CONTROL,       /* Selector */
                                  channel,              /* channel  */
                                  0x02U);               /* length   */
      if (req_status != USBH_BUSY)
      { AUDIO_Handle->cs_req_state = AUDIO_REQ_GET_MIN_VOLUME;
        VolumeCtl = LE16(&(AUDIO_Handle->mem[0]));
        AUDIO_Handle->headphone.attribute.volume = (uint32_t)VolumeCtl;
      }
      break;

    case AUDIO_REQ_GET_MIN_VOLUME:
      req_status = USBH_AC_GetMin(phost,
                                  UAC_FEATURE_UNIT,     /* subtype  */
                                  feature,              /* feature  */
                                  VOLUME_CONTROL,       /* Selector */
                                  channel,              /* channel  */
                                  0x02U);               /* length   */
      if (req_status != USBH_BUSY)
      { AUDIO_Handle->cs_req_state = AUDIO_REQ_GET_MAX_VOLUME;
        VolumeCtl = LE16(&(AUDIO_Handle->mem[0]));
        AUDIO_Handle->headphone.attribute.volumeMin = (uint32_t)VolumeCtl;
      }
      break;

    case AUDIO_REQ_GET_MAX_VOLUME:
      req_status = USBH_AC_GetMax(phost,
                                  UAC_FEATURE_UNIT,     /* subtype  */
                                  feature,              /* feature  */
                                  VOLUME_CONTROL,       /* Selector */
                                  channel,              /* channel  */
                                  0x02U);               /* length   */
      if (req_status != USBH_BUSY)
      { AUDIO_Handle->cs_req_state = AUDIO_REQ_GET_RESOLUTION;
        VolumeCtl = LE16(&(AUDIO_Handle->mem[0]));
        AUDIO_Handle->headphone.attribute.volumeMax = (uint32_t)VolumeCtl;

        if (AUDIO_Handle->headphone.attribute.volumeMax < AUDIO_Handle->headphone.attribute.volumeMin)
        { AUDIO_Handle->headphone.attribute.volumeMax = 0xFF00U;
        }
      }
      break;

