altomaltes/libOTG-stm32f4/src/libs/otg/host/Class/AUDIO/usbh_audio.c
      return (uint32_t)((UnitID << 16U) | (UAC_OUTPUT_TERMINAL << 8U) | Index);
  } }

  /* No associated Unit found return undefined ID 0x00*/
  return 0U;
}

/**
  * @brief  Build full path for Microphone device
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_BuildMicrophonePath(USBH_HandleTypeDef *phost)
{ byte UnitID = 0U, Type, Index;
  uint32_t value;
  byte terminalIndex;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  USBH_StatusTypeDef ret = USBH_OK;

  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

/* Find microphone IT
 */
  for ( terminalIndex = 0U
      ; terminalIndex < AUDIO_Handle->class_desc.InputTerminalNum
      ; terminalIndex++ )
  { if (LE16(AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[terminalIndex]->wTerminalType) == 0x201U)
    { UnitID = AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[terminalIndex]->bTerminalID;
      AUDIO_Handle->microphone.asociated_channels =  AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[terminalIndex]->bNrChannels;
      break;
  } }

  do
  { value = USBH_AUDIO_FindLinkedUnit(phost, UnitID);

    if (value == 0U)
    { return USBH_FAIL;
    }

    Index = (byte)(value & 0xFFU);
    Type = (byte)((value >> 8U) & 0xFFU);
    UnitID = (byte)((value >> 16U) & 0xFFU);

    switch (Type)
    { case UAC_FEATURE_UNIT:    AUDIO_Handle->microphone.asociated_feature = Index; break;
      case UAC_MIXER_UNIT:      AUDIO_Handle->microphone.asociated_mixer   = Index; break;
      case UAC_SELECTOR_UNIT:   AUDIO_Handle->microphone.asociated_selector= Index; break;
      case UAC_OUTPUT_TERMINAL: AUDIO_Handle->microphone.asociated_terminal= Index; break;
      default:        ret = USBH_FAIL;        break;
  } }
  while ((Type != UAC_OUTPUT_TERMINAL) && (value > 0U));

  return ret;
}

/**
  * @brief  Build full path for Headphone device
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_BuildHeadphonePath()
{ byte UnitID = 0U, Type, Index;
  uint32_t value;
  byte terminalIndex;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  USBH_StatusTypeDef ret = USBH_OK;

  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

/* Find association between audio streaming and microphone
 */
  for ( terminalIndex = 0U
      ; terminalIndex < AUDIO_Handle->class_desc.InputTerminalNum
      ; terminalIndex++ )
  { if (LE16(AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[terminalIndex]->wTerminalType) == 0x101U)
    { UnitID = AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[terminalIndex]->bTerminalID;
      AUDIO_Handle->headphone.asociated_channels =  AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[terminalIndex]->bNrChannels;
      break;
  } }

  for (Index = 0U; Index < AUDIO_Handle->class_desc.ASNum; Index++)
  { if (AUDIO_Handle->class_desc.as_desc[Index].GeneralDesc->bTerminalLink == UnitID)
    { AUDIO_Handle->headphone.asociated_as = Index;
      break;
  } }

  do
  { value = USBH_AUDIO_FindLinkedUnit(phost, UnitID);

    if (value == 0U)
    { return USBH_FAIL;
    }

    Index = (byte)(value & 0xFFU);
    Type = (byte)((value >> 8U) & 0xFFU);
    UnitID = (byte)((value >> 16U) & 0xFFU);

    switch (Type)
    { case UAC_FEATURE_UNIT:        AUDIO_Handle->headphone.asociated_feature = Index;        break;
      case UAC_MIXER_UNIT:        AUDIO_Handle->headphone.asociated_mixer = Index;        break;
      case UAC_SELECTOR_UNIT:        AUDIO_Handle->headphone.asociated_selector = Index;        break;

      case UAC_OUTPUT_TERMINAL:
        AUDIO_Handle->headphone.asociated_terminal = Index;
        if (Index < AUDIO_MAX_NUM_OUT_TERMINAL)
        { if (LE16(AUDIO_Handle->class_desc.cs_desc.OutputTerminalDesc[Index]->wTerminalType) != 0x103U)
          { return  USBH_OK;
        } }
        else
        { ret = USBH_FAIL;
        }
        break;

      default:
        ret = USBH_FAIL;
        break;
  } }
  while ((Type != UAC_OUTPUT_TERMINAL) && (value > 0U));

  return ret;
}


/**
  * @brief  Handle Set Cur request
  * @param  phost: Host handle
  * @param  subtype: subtype index
  * @param  feature: feature index
  * @param  controlSelector: control code
  * @param  channel: channel index
  * @param  length: Command length
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AC_SetCur( byte subtype
                                        , byte feature
                                        , byte controlSelector
                                        , byte channel
                                        , word length )
{ word wValue = 0U, wIndex = 0U, wLength = 0U;
  byte UnitID, InterfaceNum;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;
  USBH_StatusTypeDef ret = USBH_OK;

  switch (subtype)
  { case UAC_INPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      AUDIO_Handle->mem[0] = 0x00U;

      wLength = 1U;
      break;
    case UAC_FEATURE_UNIT:
      UnitID = AUDIO_Handle->class_desc.cs_desc.FeatureUnitDesc[feature]->bUnitID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      /*holds the CS(control selector ) and CN (channel number)*/
      wValue = (word)((uint32_t)controlSelector << 8U) | (word)channel;
      wLength = length;
      break;

    default:
      ret = USBH_FAIL;
      break;
  }

  if (ret != USBH_OK)
  { return ret;
  }

  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
                                         | USB_REQ_TYPE_CLASS;

  phost->Control.setup.b.bRequest = UAC_SET_CUR;
  phost->Control.setup.b.wValue.w = wValue;
  phost->Control.setup.b.wIndex.w = wIndex;
  phost->Control.setup.b.wLength.w = wLength;

  return (USBH_CtlReq(phost, (byte *)(void *)(AUDIO_Handle->mem), wLength));
}

/**
  * @brief  Handle Get Cur request
  * @param  phost: Host handle
  * @param  subtype: subtype index
  * @param  feature: feature index
  * @param  controlSelector: control code
  * @param  channel: channel index
  * @param  length: Command length
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AC_GetCur( byte subtype
                                        , byte feature
                                        , byte controlSelector
                                        , byte channel
                                        ,  word length )
{ word wValue = 0U, wIndex = 0U, wLength = 0U;
  byte UnitID = 0U, InterfaceNum = 0U;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;
  USBH_StatusTypeDef ret = USBH_OK;

