altomaltes/libOTG-stm32f4/src/libs/otg/host/Class/AUDIO/usbh_audio.c
  switch (subtype)
  { case UAC_INPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      AUDIO_Handle->mem[0] = 0x00U;

      wLength = 1U;
      break;
    case UAC_FEATURE_UNIT:
      UnitID = AUDIO_Handle->class_desc.cs_desc.FeatureUnitDesc[feature]->bUnitID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      /*holds the CS(control selector ) and CN (channel number)*/
      wValue = (word)((uint32_t)controlSelector << 8U) | (word)channel;
      wLength = length;
      break;

    case UAC_OUTPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.OutputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      wLength = 1U;
      break;

    default:
      ret = USBH_FAIL;
      break;
  }

  if (ret != USBH_OK)
  { return ret;
  }

  phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_RECIPIENT_INTERFACE | \
                                         USB_REQ_TYPE_CLASS;

  phost->Control.setup.b.bRequest = UAC_GET_CUR;
  phost->Control.setup.b.wValue.w = wValue;
  phost->Control.setup.b.wIndex.w = wIndex;
  phost->Control.setup.b.wLength.w = wLength;

  return (USBH_CtlReq(phost, (byte *)(void *)(AUDIO_Handle->mem), wLength));
}


/**
  * @brief  Handle Get Max request
  * @param  subtype: subtype index
  * @param  feature: feature index
  * @param  controlSelector: control code
  * @param  channel: channel index
  * @param  length: Command length
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AC_GetMax( byte subtype
                                        , byte feature
                                        , byte controlSelector
                                        , byte channel
                                        , word length )
{ word wValue = 0U, wIndex = 0U, wLength = 0U;
  byte UnitID = 0U, InterfaceNum = 0U;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;
  USBH_StatusTypeDef ret = USBH_OK;

  switch (subtype)
  { case UAC_INPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      AUDIO_Handle->mem[0] = 0x00U;

      wLength = 1U;
      break;
    case UAC_FEATURE_UNIT:
      UnitID = AUDIO_Handle->class_desc.cs_desc.FeatureUnitDesc[feature]->bUnitID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      /*holds the CS(control selector ) and CN (channel number)*/
      wValue = (word)((uint32_t)controlSelector << 8U) | (word)channel;
      wLength = length;
      break;

    case UAC_OUTPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.OutputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      wLength = 1U;
      break;

    default:
      ret = USBH_FAIL;
      break;
  }

  if (ret != USBH_OK)
  { return ret;
  }

  phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_RECIPIENT_INTERFACE | \
                                         USB_REQ_TYPE_CLASS;

  phost->Control.setup.b.bRequest = UAC_GET_MAX;
  phost->Control.setup.b.wValue.w = wValue;
  phost->Control.setup.b.wIndex.w = wIndex;
  phost->Control.setup.b.wLength.w = wLength;

  return (USBH_CtlReq(phost, (byte *)(void *)(AUDIO_Handle->mem), wLength));

}

/**
  * @brief  Handle Get Res request
  * @param  phost: Host handle
  * @param  subtype: subtype index
  * @param  feature: feature index
  * @param  controlSelector: control code
  * @param  channel: channel index
  * @param  length: Command length
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AC_GetRes(USBH_HandleTypeDef *phost,
    byte subtype,
    byte feature,
    byte controlSelector,
    byte channel,
    word length)
{ word wValue = 0U, wIndex = 0U, wLength = 0U;
  byte UnitID = 0U, InterfaceNum = 0U;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;
  USBH_StatusTypeDef ret = USBH_OK;

  switch (subtype)
  { case UAC_INPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.InputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      AUDIO_Handle->mem[0] = 0x00U;

      wLength = 1U;
      break;
    case UAC_FEATURE_UNIT:
      UnitID = AUDIO_Handle->class_desc.cs_desc.FeatureUnitDesc[feature]->bUnitID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      /*holds the CS(control selector ) and CN (channel number)*/
      wValue = (word)((uint32_t)controlSelector << 8U) | (word)channel;
      wLength = length;
      break;

    case UAC_OUTPUT_TERMINAL:
      UnitID = AUDIO_Handle->class_desc.cs_desc.OutputTerminalDesc[0]->bTerminalID;
      InterfaceNum = 0U; /*Always zero Control Interface */
      wIndex = (word)((uint32_t)UnitID << 8U) | (word)InterfaceNum;
      wValue = (COPY_PROTECT_CONTROL << 8U);
      wLength = 1U;
      break;

    default:
      ret = USBH_FAIL;
      break;
  }

  if (ret != USBH_OK)
  { return ret;
  }

  phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_RECIPIENT_INTERFACE
                                         | USB_REQ_TYPE_CLASS;

  phost->Control.setup.b.bRequest = UAC_GET_RES;
  phost->Control.setup.b.wValue.w = wValue;
  phost->Control.setup.b.wIndex.w = wIndex;
  phost->Control.setup.b.wLength.w = wLength;

  return (USBH_CtlReq(phost, (byte *)(void *)(AUDIO_Handle->mem), wLength));

