altomaltes/libOTG-stm32f4/src/libs/otg/host/Class/AUDIO/usbh_audio.c
      status = USBH_AUDIO_SetEndpointControls(phost, AUDIO_Handle->headphone.Ep, buff);
      if (status == USBH_OK)
      { AUDIO_Handle->play_state = AUDIO_PLAYBACK_IDLE;
      }
      break;

    case AUDIO_PLAYBACK_SET_EP:
      buff = (byte *)(void *)&AUDIO_Handle->headphone.frequency;
      status = USBH_AUDIO_SetEndpointControls(phost, AUDIO_Handle->headphone.Ep, buff);
      if (status == USBH_OK)
      { AUDIO_Handle->play_state = AUDIO_PLAYBACK_IDLE;
        USBH_AUDIO_FrequencySet(phost);
      }
      break;

    case AUDIO_PLAYBACK_IDLE:
      status = USBH_OK;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case AUDIO_PLAYBACK_PLAY:
      (void)USBH_AUDIO_Transmit(phost);
      status = USBH_OK;
      break;

    default:
      break;
  }

  return status;
}

/**
  * @brief  Handle Transmission process
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_AUDIO_Transmit(USBH_HandleTypeDef *phost)
{ USBH_StatusTypeDef status = USBH_BUSY;
  AUDIO_HandleTypeDef *AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

  switch (AUDIO_Handle->processing_state)
  { case AUDIO_DATA_START_OUT:
      /* Sync with start of Even Frame */
      if ((phost->Timer & 1U) == 0U)
      { AUDIO_Handle->headphone.timer = phost->Timer;
        AUDIO_Handle->processing_state = AUDIO_DATA_OUT;
        (void)USBH_IsocSendData(phost,
                                AUDIO_Handle->headphone.buf,
                                (uint32_t)AUDIO_Handle->headphone.frame_length,
                                AUDIO_Handle->headphone.Pipe);

        AUDIO_Handle->headphone.partial_ptr = AUDIO_Handle->headphone.frame_length;
        AUDIO_Handle->headphone.global_ptr = AUDIO_Handle->headphone.frame_length;
        AUDIO_Handle->headphone.cbuf = AUDIO_Handle->headphone.buf;
      }
      else
      {

#if (USBH_USE_OS == 1U)
        osDelay(1);
        phost->os_msg = (uint32_t)USBH_CLASS_EVENT;

#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;

    case AUDIO_DATA_OUT:
      if ((USBH_LL_GetURBState(phost, AUDIO_Handle->headphone.Pipe) == USBH_URB_DONE) &&
          ((phost->Timer - AUDIO_Handle->headphone.timer) >= AUDIO_Handle->headphone.Poll))
      { AUDIO_Handle->headphone.timer = phost->Timer;

        if (AUDIO_Handle->control.supported == 1U)
        { (void)USBH_AUDIO_Control(phost);
        }

        if (AUDIO_Handle->headphone.global_ptr <= AUDIO_Handle->headphone.total_length)
        { (void)USBH_IsocSendData(phost,
                                  AUDIO_Handle->headphone.cbuf,
                                  (uint32_t)AUDIO_Handle->headphone.frame_length,
                                  AUDIO_Handle->headphone.Pipe);

          AUDIO_Handle->headphone.cbuf += AUDIO_Handle->headphone.frame_length;
          AUDIO_Handle->headphone.partial_ptr += AUDIO_Handle->headphone.frame_length;
          AUDIO_Handle->headphone.global_ptr += AUDIO_Handle->headphone.frame_length;
        }
        else
        { AUDIO_Handle->headphone.partial_ptr = 0xFFFFFFFFU;
          AUDIO_Handle->play_state = AUDIO_PLAYBACK_IDLE;
          USBH_AUDIO_BufferEmptyCallback(phost);
        }
      }
      break;

    default:
      status = USBH_FAIL;
      break;
  }
  return status;
}

/**
  * @brief  USBH_AUDIO_SetFrequency
  *         Set Audio sampling parameters
  * @param  phost: Host handle
  * @param  SampleRate: Sample Rate
  * @param  NbrChannels: Number of Channels
  * @param  BitPerSample: Bit Per Sample
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_AUDIO_SetFrequency(USBH_HandleTypeDef *phost,
    word SampleRate,
    byte  NbrChannels,
    byte  BitPerSample)
{ USBH_StatusTypeDef Status = USBH_BUSY;
  AUDIO_HandleTypeDef *AUDIO_Handle;
  byte              index;
  byte              change_freq = FALSE;
  uint32_t             freq_min, freq_max;
  byte              num_supported_freq;

  if (phost->gState == HOST_CLASS)
  { AUDIO_Handle = (AUDIO_HandleTypeDef *) phost->pActiveClass->pData;

    if (AUDIO_Handle->play_state == AUDIO_PLAYBACK_IDLE)
    { if (AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->bSamFreqType == 0U)
      { freq_min = LE24(AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->tSamFreq[0]);
        freq_max = LE24(AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->tSamFreq[1]);

        if ((SampleRate >= freq_min) && (SampleRate <= freq_max))
        { change_freq = TRUE;
        }
      }
      else
      { num_supported_freq = (AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->bLength - 8U) / 3U;

        for (index = 0U; index < num_supported_freq; index++)
        { if (SampleRate == LE24(
                AUDIO_Handle->class_desc.as_desc[AUDIO_Handle->headphone.asociated_as].FormatTypeDesc->tSamFreq[index]))
          { change_freq = TRUE;
            break;
          }
        }
      }

      if (change_freq == TRUE)
      { AUDIO_Handle->headphone.frequency = SampleRate;
        AUDIO_Handle->headphone.frame_length = (SampleRate * BitPerSample * NbrChannels) / 8000U;
        AUDIO_Handle->play_state = AUDIO_PLAYBACK_SET_EP;
        Status = USBH_OK;
      }
    }
  }
  return Status;
}

/**
  * @brief  USBH_AUDIO_Play
  *         Start playback process
  * @param  phost: Host handle
  * @param  buf: pointer to raw audio data
  * @param  length: total length of the audio data
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_AUDIO_Play(USBH_HandleTypeDef *phost, byte *buf, uint32_t length)
{ USBH_StatusTypeDef Status = USBH_FAIL;
  AUDIO_HandleTypeDef *AUDIO_Handle;

